/******************************************************************************
	クラリオン殿向け
	プロジェクト名	: 2012年AMFM_RADIOモデル
	ファイル名		: aux_sys.h
	機能			: AUXモジュールSystemとのヘッダファイル
------------------------------------------------------------------------------
日付		担当者		修正内容
2012/07/26	東海林		新規作成
******************************************************************************/
#ifndef	_AUX_SYS_H_
#define	_AUX_SYS_H_

#undef	EXT
#ifdef	_AUX_SYS_C_
#define	EXT
#else
#define	EXT	extern
#endif

EXT	void	Aux_sys_message(BYTE );

#endif
