//DMA転送によるD/Aコンバータの出力
//1kHzのサインウェーブを出力する
//dma_3.c
#include  <3048.h>                //3048、3052の内部I/O定義

unsigned char sindata[128] = {127,133,139,146,152,158,164,170, //出力データ
                              176,181,187,192,198,203,208,212,
                              217,221,225,229,233,236,239,242,
                              244,247,249,250,252,253,253,254,
                              254,254,253,253,252,250,249,247,
                              244,242,239,236,233,229,225,221,
                              217,212,208,203,198,192,187,181,
                              176,170,164,158,152,146,139,133,
                              127,121,115,108,102,96,90,84,
                              78,73,67,62,56,51,46,42,
                              37,33,29,25,21,18,15,12,
                              10,7,5,4,2,1,1,0,
                              0,0,1,1,2,4,5,7,
                              10,12,15,18,21,25,29,33,
                              37,42,46,51,56,62,67,73,
                              78,84,90,96,102,108,115,121};
                              
void ituinit(void)                //ITUイニシャライズ
{
     
    ITU0.TCR.BIT.CCLR    = 1;     //カウンタクリア要因
    ITU0.TCR.BIT.TPSC    = 0;     //25MHz 周期　0.04μs
    ITU0.GRA =194;                //1kHz 周期 1ms、1サイクルの出力数 128、 周期　1/128=0.0078125ms 0.0078125ms=7.8125μs 7.8125/0.04=約195
    ITU0.TIER.BIT.IMIEA = 1;      //IMFAフラグによる割り込み許可
    ITU0.TCR.BIT.CCLR    = 1;     //カウンタクリア要因
}

void dainit(void)                 //D/Aコンバータイニシャライズ
{
    DA.DACR.BIT.DAOE0 = 1;
    DA.DACR.BIT.DAE = 0;
}

void dmainit(void)
{
    DMAC0A.MAR = sindata;
    DMAC0A.IOAR = 0xdc;            //D/Aチャネル0アドレス
    DMAC0A.ETCR = 0x8080;          //128回出力
    DMAC0A.DTCR.BIT.RPE = 1; 
    DMAC0A.DTCR.BIT.DTE = 1;
}   

int main(void)
{
    dainit();
    dmainit();
    ituinit();
    ITU.TSTR.BIT.STR0 = 1;         //タイマスタート
    while (1);                     //何もしない
}
