/******************************************************************************
   クラリオン殿向け                    2007ﾓﾃﾞﾙ
		ﾌﾟﾛｼﾞｪｸﾄ名	: '12年 AMFMﾗｼﾞｵ開発
		ﾌｧｲﾙ名		: io_int.c
        ﾓｼﾞｭｰﾙ名	: I/O
		機能		: ①割込み処理
------------------------------------------------------------------------------
		修正履歴	【年月日】【Version】【名前】 【説明】
------------------------------------------------------------------------------
[yamamoto20120727] 新規作成
******************************************************************************/
#define		_INT_C_
#include	"../model.h"

#define		DEFINE_SFRBITS
#include <lc884200.h>

#include	"../comm/common.h"
#include	"../main/ma_tim.h"
#include	"../main/ma_ext.h"
#include	"../key/key_func_ext.h"
#include	"../tuner/tu_io.h"
#include	"../power/pw_func_ext.h"
#include	"../submode/sbm_ext.h"
#include	"IO_ext.h"


/*------------------------------------------------------------------------------
.. 		関数名  ：_int_watchdog
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：ﾘｾｯﾄ/WDT割込み処理
------------------------------------------------------------------------------*/
void _int_watchdog( void )		/* 8000H */
{
	if (__bf_WDTCR.OVF == TRUE)
	{
		
	}
}
/*------------------------------------------------------------------------------
.. 		関数名  ：_int_basetimer_watchtimer
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：｢8004H｣ WatchTimer(1)/Timer8(2)割込み処理
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_basetimer_watchtimer( void )		/* 8004H */
{
	#if 1
	/* 500ms割込み */
	if ((__byte_CKTIMCTRL & BIN_00000011 ) == BIN_00000011)
	{
		__byte_CKTIMCTRL |= BIN_00000010;
		
		/* 500ms割込み用処理 */
		Pw_acc_off_nor_req(CPW_HOLDX_INT_CKL);
	}
	#endif
	
	/* T8割込み1周期  62.5ms割り込み */
	if (__bf_BTCR.FLG1 == TRUE)
	{
		__bf_BTCR.FLG1 = FALSE;
		if (__bf_BTCR.IE1 == TRUE )
		{
			#if 0	/* 精度向上のため */
			Pw_62ms_cycle();			/* 電源62.5ms周期処理 */
			#else
			Pw_4ms_timer();				/* 電源62.5msの1/16周期処理 */
			#endif
		}
	}
	/* T8割込み0周期 未使用 */
	if (__bf_BTCR.FLG0 == TRUE)
	{
		__bf_BTCR.IE0 = FALSE;		/* 未使用ため割込み禁止 */
		__bf_BTCR.FLG0 = FALSE;
	}
}
/*------------------------------------------------------------------------------
.. 		関数名  ：_int_timer0
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：Timer0(2)割込み処理
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_timer0( void )		/* 8008H */
{
	if (__bf_T0CNT.FLG == TRUE)
	{
		__bf_T0CNT.FLG = FALSE;
		#if 0
		if (__bf_T0CNT.IE == TRUE)
		{
			Ma_tim_int_1ms();
		}
		#endif
	}
	/* ｿﾌﾄｳｪｱ割り込み制御未使用 */
	if (__bf_T0CNT.SIFLG == TRUE)
	{
		__bf_T0CNT.SIIE = FALSE;
		__bf_T0CNT.SIFLG = FALSE;
	}
}
/*------------------------------------------------------------------------------
.. 		関数名  ：_int_int0
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：INT0(1)割込み処理
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_int0( void ) 		/* 800CH */
{
}
/*------------------------------------------------------------------------------
.. 		関数名  ：_int_irq_4
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：未使用
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_irq_4( void ) 		/* 8010H */
{
}
/*------------------------------------------------------------------------------
.. 		関数名  ：_int_int1
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：INT1(1)割り込み処理
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_int1( void ) 		/* 8014H */
{
}
/*------------------------------------------------------------------------------
.. 		関数名  ：_int_share_6
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：INT2(1)/Timer1(2)/UART2(3)割込み処理
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_share_6( void ) 		/* 8018H */
{
	if ((__bf_INT23CR.INT2IE == TRUE ) &&
		(__bf_INT23CR.INT2IF == TRUE))
	{
		__bf_INT23CR.INT2IF = FALSE;
	}
	
	/* T1 10ms割込み ACCOFF時ALARMキーチャタ用 */
	if (__bf_T1CNT.FLG == TRUE)
	{
		//__bf_T1CNT.IE = FALSE;
		__bf_T1CNT.FLG = FALSE;
		
		Pw_10ms_timer();
		Key_10ms_timer_accoff();			/* AccOff中にAlarmキー長押しタイマー */
	}
	/* T1H 割込み未使用、割込み禁止 */
	if (__bf_T1CNT.HFLG == TRUE)
	{
		__bf_T1CNT.HIE = FALSE;
		__bf_T1CNT.HFLG = FALSE;
	}
	/* UART2割込み */
	if ((__bf_U2CNT0.RIE == TRUE) &&
		(__bf_U2CNT0.RREADY == TRUE))			/* 受信割込み */
	{
		IO_Uart2_RXData = __byte_U2RBUF;
		#if 0 /* 制御不要 */
		__bf_U2CNT0.RREADY = FALSE;
		#endif
		#if _TEST_MODE_
		Test_Mode_Int_Rcv();
		#endif
		__bf_U2CNT0.RERR = FALSE;
	}
	if ((__bf_U2CNT0.TEMPTYIE == TRUE) && 
		(__bf_U2CNT0.TEMPTY == TRUE))		/* 送信ﾊﾞｯﾌｧ転送完了割込み */
	{
		#if _TEST_MODE_
		Test_Mode_Int_Snd();
		#endif
	}
	if ((__bf_U2CNT0.TENDIE == TRUE) &&
		(__bf_U2CNT0.TEND == TRUE))			/* 送信完了割込み */
	{
		/* 特に処理無し */
		__bf_U2CNT0.TEND = FALSE;
	}
}
/*------------------------------------------------------------------------------
.. 		関数名  ：_int_share_7
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：INT3(1)/Timer2(3)/SMIIC0(1)割込み処理
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_share_7( void )		/* 801CH */
{
	if ((__bf_INT23CR.INT3IF == TRUE) &&
		(__bf_INT23CR.INT3IE == TRUE))
	{
		/* ACC-DET端子割込み処理 */
		__bf_INT23CR.INT3IF = FALSE;
		__bf_INT23CR.INT3IE = FALSE;
		
		/* ACC-DET割り込み処理 */
		Pw_acc_off_nor_req(CPW_HOLDX_INT_ACC);
	}
	if ((__bf_T2CNT1.CPIE == TRUE)&&
		(__bf_T2CNT1.CP0LFLG == TRUE))
	{
		__bf_T2CNT1.CPIE = FALSE;
		__bf_T2CNT1.CP0LFLG = FALSE;
	}
	if ((__bf_T2CNT0.IE == TRUE) && 
		(__bf_T2CNT0.FLG == TRUE))
	{
		__bf_T2CNT0.FLG = FALSE;
		
		Ma_tim_int_1ms();
	}
	
	/* SMIIC0割込み */
	
}
/*------------------------------------------------------------------------------
.. 		関数名  ：_int_irq_8
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：INT4(1)/Timer3(2)/SMIIC1(1)/赤外線ﾘﾓｺﾝ受信割込み処理(4)
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_irq_8( void ) 		/* 8020H */
{
}
/*------------------------------------------------------------------------------
.. 		関数名  ：_int_timer4
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：INT5(1)/Timer4(1)/SIO1(2)割込み処理
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_timer4( void )		/* 8024H */
{
}
/*------------------------------------------------------------------------------
.. 		関数名  ：_int_irq_a
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：なし
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_irq_a( void ) 		/* 8028H */
{
}
/*------------------------------------------------------------------------------
.. 		関数名  ：_int_irq_b
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：PWM0(1)/PWM1(1)/SMIIC2(1)割込み処理
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_irq_b( void ) 		/* 802CH */
{
}
/*------------------------------------------------------------------------------
.. 		関数名  ：_int_timer5
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：ADC(1)/Timer5(1)/SMIIC3(1)割込み処理
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_timer5( void ) 		/* 8030H */
{
}
/*------------------------------------------------------------------------------
.. 		関数名  ：_int_irq_d
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：INT6(1)/Timer6(1)/UART3(3)割込み処理
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_irq_d( void )		/* 8034H */
{
}
/*------------------------------------------------------------------------------
.. 		関数名  ：_int_sio0
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：INT7(1)/Timer7(1)/SIO0(2)/UART4(3)割込み処理
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_sio0( void ) 		/* 8038H */
{
	#if 0
	/* UART4割込み */
	if (__bf_U4CNT0.RREADY == TRUE)		/* 受信割込み */
	{
		__bf_U4CNT0.RREADY = FALSE;
		__bf_U4CNT0.RERR = FALSE;
	}
	if (__bf_U4CNT0.TEMPTY == TRUE)		/* 送信ﾊﾞｯﾌｧ転送完了割込み */
	{
	}
	#endif
	#if 0		/* [sun100823] 三洋さんから要望でTENDﾌﾗｸﾞｸﾘｱしないように変更 */
	if (__bf_U4CNT0.TEND == TRUE)	/* 送信完了割込み */
	{
		__bf_U4CNT0.TEND = FALSE;
	}
	#endif
	
}
/*------------------------------------------------------------------------------
.. 		関数名  ：_int_port0
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：Port0(3)/Port5(8)/UART5(3)割込み処理
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_port0( void )		/* 803CH */
{
/* Port0 INT処理 */
	if ((__bf_P0FSA.P04IE == TRUE)&&(__bf_P0FSA.P04FLG == TRUE))
	{
		__bf_P0FSA.P04FLG = FALSE;
		__bf_P0FSA.P04IE = FALSE;
		
		/* AccOFF中、alarm key割込み処理 */
		Pw_acc_off_nor_req(CPW_HOLDX_INT_ALM);
	}
}

/*------------------------------------------------------------------------------
.. 		関数名  ：_int_exception
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：??割込み処理
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_exception(void)
{
}

/*------------------------------------------------------------------------------
.. 		関数名  ：_int_lowvoltage
		引  数	：無し
		戻り値	：無し
		破  壊	：無し
		機  能	：??割込み処理
-------------------------------------------------------------------------------
[20120730yamamoto] 新規作成
------------------------------------------------------------------------------*/
void _int_lowvoltage( void )
{
}

#undef	_INT_C_
