/******************************************************************************
   クラリオン殿向け                    2008年 LOW2-L/LOW3ｼﾘｰｽﾞ
      ﾌﾟﾛｼﾞｪｸﾄ名   : '07年 8bitETRｺﾝﾄﾛｰﾗ対応ﾓﾃﾞﾙ開発  phat trien viec giao tiep bo 8bit ETR controller nam 07 
      ﾌｧｲﾙ名      : IO_inc.h
        ﾓｼﾞｭｰﾙ名   : I/O
      機能      : PORT定義外部公開用ヘッダﾌｧｲﾙ
------------------------------------------------------------------------------
   修正履歴【年月日】【Ver】【名前】 【説明】
------------------------------------------------------------------------------
[sun100420] 16ビットﾏｲｺﾝ用新規作成   tao ra su moi la trong viec dung VDK 16 bit
******************************************************************************/

#include   "../io/IO_def.h"
#include   "../io/IO_ext.h"
