/******************************************************************************
	クラリオン殿向け
	プロジェクト名	: 2012年AMFM_RADIOモデル
	ファイル名		: key_sys.h
	機	能			: Keyモジュール・System Message関数群ヘッダーファイル
------------------------------------------------------------------------------
日付		担当者		修正内容
2012/07/26	東海林		新規作成
******************************************************************************/
#ifndef	_KEY_SYS_H_
#define	_KEY_SYS_H_

#undef	EXT
#ifdef	_KEY_SYS_C_
#define	EXT   
#else
#define	EXT	extern
#endif

EXT	void	Key_sys_message(BYTE );

#endif