/******************************************************************************
	クラリオン（株）殿向け		2007 C3X03 ｼﾘｰｽﾞ[仮]

		プロジェクト名	: '07年フリップダウン　MP3モデル開発
		ファイル名		: pw_sys.h
		機能			: ①電源制御ﾓｼﾞｭｰﾙ･System Message関数群　ﾍｯﾀﾞｰ･ﾌｧｲﾙ
------------------------------------------------------------------------------
修正履歴
【番号】	日付		担当者	修正内容
【NKC-0000】'05/12/09	仲地	新規作成
******************************************************************************/
#ifndef	_PW_SYS_H_
#define	_PW_SYS_H_

#undef	EXT
#ifdef	_PW_SYS_C_
#define	EXT   
#else
#define	EXT	extern
#endif

EXT	void	Pw_sys_message(BYTE );
EXT	void	Pw_initial(void);

#endif
