/******************************************************************************
..     クラリオン殿向け                    2007ﾓﾃﾞﾙ

		プロジェクト名	: 
		ファイル名		: ma_sys.h
		機能			: Mainｼｽﾃﾑﾒｯｾｰｼﾞ受付処理ﾍｯﾀﾞﾌｧｲﾙ
------------------------------------------------------------------------------
		修正履歴	【年月日】【Version】【名前】 【説明】
------------------------------------------------------------------------------
[sun051128]	新規作成
******************************************************************************/
#ifndef		_MA_SYS_H_
#define		_MA_SYS_H_

#undef	EXT
#ifdef	_MA_SYS_C_
#define	EXT	    
#else
#define	EXT		extern
#endif

/*----------------------------------------------------
   関数プロトタイプ
----------------------------------------------------*/
EXT	void	Ma_sys_message(BYTE	msg);
EXT void	Ma_10ms_timer(void);

#endif
