/******************************************************************************
   クラリオン殿向け                    2008年 LOW2-L/LOW3ｼﾘｰｽﾞ
		ﾌﾟﾛｼﾞｪｸﾄ名	: '07年 8bitETRｺﾝﾄﾛｰﾗ対応ﾓﾃﾞﾙ開発
		ﾌｧｲﾙ名		: KEY_inc.h
        ﾓｼﾞｭｰﾙ名	: KEY
		機能		: PORT定義外部公開用ヘッダﾌｧｲﾙ
------------------------------------------------------------------------------
	修正履歴【年月日】【Ver】【名前】 【説明】
------------------------------------------------------------------------------
[sun100420] 16ビットﾏｲｺﾝ用新規作成
******************************************************************************/

#include	"../key/key_def.h"
#include	"../key/key_func_ext.h"
