/******************************************************************************
..     クラリオン殿向け                    2007ﾓﾃﾞﾙ

		プロジェクト名	:
		ファイル名		: tu_sys.h
		機能			: ①TunerﾓｼﾞｭｰﾙSystemとのﾍｯﾀﾞﾌｧｲﾙ
------------------------------------------------------------------------------
		修正履歴	【年月日】【Version】【名前】 【説明】
------------------------------------------------------------------------------
[sun051125]	新規作成
******************************************************************************/
#ifndef	_TU_SYS_H_
#define	_TU_SYS_H_

#undef	EXT
#ifdef	_TU_SYS_C_
#define	EXT
#else
#define	EXT	extern
#endif

EXT	void	Tu_sys_message(BYTE );
EXT	void	Tu_tim_cntdw(BYTE	*);

#endif
